###Python training session 2

_Aims_

*    Understand how to connect to databases
*    Understand how to run queries against databases

In [3]:
#Read a csv file into a dataframe
import pandas as pd
df = pd.read_csv("trade_data_utf8.csv", encoding="utf-8")

In [4]:
#Create a connection to a database
#Note that in this example, if the database does not exist, a new database will automatically be created
import sqlite3
con = sqlite3.connect('my_test_database.db')

#We're using the SQLite database here, which is a popular simple database format.
#But note that the 'connection object' that is created here could be a connection to a remote database, 
#e.g. SQL Server, PostGreSQL etc. 
#The following code would all work just the same

In [3]:
#Write the data in the dataframe to the database, using the connection to the databsae we just created
df.to_sql("trade_data",con, index=False)
#Note that 'trade_data' is the name of the table, 'con' is the connection object
#and index=False just stops it writing the index to a column on the databsae

In [7]:
#Now we can run SQL statements against the database

sql_statement = '''
select * 
from trade_data
where country = 'Germany'
'''

new_df = pd.read_sql(sql_statement, con)
new_df.to_excel("my_excel_file.xlsx")

We will interact with databases using sql, 'structured query language'

This is a programming language in its own right, and it's not specific to Python.  

This makes learning it very worthwhile because it will work in many different data analysis tools

In [5]:
#Basic SQL filters using the 'where' condition
sql_statement = """
select country, value 
from trade_data
where country = 'Germany'
"""

new_df = pd.read_sql(sql_statement, con)

In [5]:
sql_statement = """
select * 
from trade_data
where quantity > 257332675 and country = 'Germany'
"""
new_df = pd.read_sql(sql_statement, con)

In [9]:
#SQl can also be used to perform 'aggregations'

sql = """
select country, 

count(quantity) as country_count,

sum(quantity) as total_value

from trade_data

group by country
"""

pd.read_sql(sql, con).head()

          country  country_count   total_value
0         Austria             15    8244642521
1         Belgium             88  102228914393
2  Canary Islands              1     271725969
3  Czech Republic             19   20686316545
4         Denmark             24   21309919568

In [12]:
#But note that your choice of aggregation functions is quite limited
sql = """
select country, avg(quantity)
from trade_data
group by country
"""
pd.read_sql(sql, con).head()  #THIS WILL FAIL!

          country  avg(quantity)
0         Austria   5.496428e+08
1         Belgium   1.161692e+09
2  Canary Islands   2.717260e+08
3  Czech Republic   1.088754e+09
4         Denmark   8.879133e+08

###Exercises

In [17]:
#Excercise 1
#Write the contents of a csv file to a database called 'my_new_database.db', in a table called 'new_table'

In [19]:
#Exercise 2 - select only items where category_1 is equal to x and category_2 is equal to a

  category_1 category_2  value
0          x          a      1
1          x          a      6
2          x          a      5

In [16]:
#Exercise 3
df = pd.read_clipboard()

  cat_1 cat_2     value
0     a     x  0.213501
1     b     y  0.167325
2     c     z  0.616157
3     a     x  0.427496
4     a     y  0.169600

In [27]:
df.pivot_table(index="cat_1", columns="cat_2", aggfunc="median")

          value
cat_2         x   y   z
cat_1
a      0.151318 NaN NaN
b           NaN NaN NaN
c           NaN NaN NaN

In [24]:
import numpy as np
np.std

In [29]:
def my_function(x):
    return 1

df.pivot_table(index=["cat_1","cat_2"],  aggfunc=my_function)

             value
cat_1 cat_2
a     x          1
      y          1
b     y          1
c     z          1